system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Tamanho do domínio
backgroundMesh
{
    xMin   -474.9;
    xMax   934.9;
    yMin   -383.9;
    yMax   460.9;
    zMin   0;
    zMax   359.9;
    xCells  25;
    yCells  20;
    zCells  10;
}

convertToMeters 1;

vertices
(
    (-474.9 -383.9 0)    // 0
    (934.9 -383.9 0)     // 1
    (934.9 460.9 0)      // 2
    (-474.9 460.9 0)     // 3

    (-474.9 -383.9 359.9)    // 4
    (934.9 -383.9 359.9)     // 5
    (934.9 460.9 359.9)      // 6
    (-474.9 460.9 359.9)     // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        45     // xCells
        30     // yCells
        15     // zCells
    )
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
            (4 7 6 5)
        );
    }

);

