0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://openfoam.org
|   \\  /    A nd           | Version:  9
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }
	
	ground
	{
        type            wall;
    }		

    frontAndBack
    {
        type           symmetry;
    }

    H45_W15_0
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //

