system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://openfoam.org
|   \\  /    A nd           | Version:  9
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind grad(U);

    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // Adiciona esquemas para as equações de turbulência k-epsilon
    div(phi,k)          Gauss upwind;        // Discretização para k
    div(phi,epsilon)    Gauss upwind;        // Discretização para epsilon
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
