system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://openfoam.org
|   \\  /    A nd           | Version:  9
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    k
    {
        solver          PBiCGStab;          // Solver para k
        preconditioner  DILU;               // Precondicionador para k
        tolerance       1e-5;               // Tolerância
        relTol          0.1;                // Tolerância relativa
    }

    epsilon
    {
        solver          PBiCGStab;          // Solver para epsilon
        preconditioner  DILU;                // Precondicionador para epsilon
        tolerance       1e-5;               // Tolerância
        relTol          0.1;                // Tolerância relativa
    }

    kFinal
    {
        $k;                                  // Para a variável k final
        relTol          0;                   // Tolerância relativa para k final
    }

    epsilonFinal
    {
        $epsilon;                            // Para a variável epsilon final
        relTol          0;                   // Tolerância relativa para epsilon final
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
    nCorrectors         5;
}

// ************************************************************************* //

