system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Definir o número de processadores
numberOfSubdomains 6;

// Método de decomposição (pode ser "scotch", "simple", "hierarchical", etc.)
method          scotch;

